CSI API ETABS v1
cOAPI Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cOAPI
Public Interface cOAPI
Dim instance As cOAPI
public interface class cOAPI
type cOAPI =  interface end
The cOAPI type exposes the following members.
Properties
Name | Description
SapModel
 Gets a reference to cSapModel.
Top
Methods
Name | Description
ApplicationExit
 Exits the application.
ApplicationStart
 This function starts the application.
GetOAPIVersionNumber
 Retrieves the API version number implemented by the GUI.
Hide
 This function hides the application. When the application is hidden it is not visible on the screen or on the Windows task bar.
InternalExec
 For internal use.
SetAsActiveObject
 This function sets the active ETABSObject instance in the system Running Object Table (ROT), replacing the previous instance (if any).
Unhide
 This function unhides the application, that is, it makes it visible. When the application is hidden, it is not visible on the screen or on the Windows task bar.
UnsetAsActiveObject
 This function removes the ETABSObject instance from the system Running Object Table (ROT).
Visible
 This function gets the application visibility.
Top
See Also
Reference
ETABSv1 Namespace